number = int(input("Введите число от 1 до 1000: "))

def number_words(num):
   units = {
      0: '',
        1: 'один',
        2: 'два',
        3: 'три',
        4: 'четыре',
        5: 'пять',
        6: 'шесть',
        7: 'семь',
        8: 'восемь',
        9: 'девять',
        10: 'десять',
        11: 'одиннадцать',
        12: 'двенадцать',
        13: 'тринадцать',
        14: 'четырнадцать',
        15: 'пятнадцать',
        16: 'шестнадцать',
        17: 'семнадцать',
        18: 'восемнадцать',
        19: 'девятнадцать'
   }

   tens = {
        2: 'двадцать',
        3: 'тридцать',
        4: 'сорок',
        5: 'пятьдесят',
        6: 'шестьдесят',
        7: 'семьдесят',
        8: 'восемьдесят',
        9: 'девяносто'
    }
   hundreds = {
        1: 'сто',
        2: 'двести',
        3: 'триста',
        4: 'четыреста',
        5: 'пятьсот',
        6: 'шестьсот',
        7: 'семьсот',
        8: 'восемьсот',
        9: 'девятьсот'
   }
   if 1 <= num <= 19:
    return units[num]
   elif 20 <= num <= 99:
    return tens[num//10] + " " + units[num%10]
   elif 100 <= num <= 999:
     return hundreds[num//100] + " " + number_words(num%100)
   elif num == 1000:
     return "тысяча"
   else:
     return "Вы ввели некоректоное значение нужно от 1 до 1000"
   
print (number_words(number))
   